---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCProductWrapper Properties
IFCProductWrapper Class See Also Send Feedback
---

The IFCProductWrapper type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Count | The number of objects associated with the IfcProduct in this wrapper. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace